andrewlau2080/IO_BOARD/.vendor/AT32F45x_Firmware_Library_V2.0.1/project/at_start_f457/examples/adc/combine_mode_preempt_interltrig/src/main.c
/**
  **************************************************************************
  * @file     main.c
  * @brief    main program
  **************************************************************************
  *
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f45x_board.h"
#include "at32f45x_clock.h"

/** @addtogroup AT32F457_periph_examples
  * @{
  */

/** @addtogroup 457_ADC_combine_mode_preempt_interltrig ADC_combine_mode_preempt_interltrig
  * @{
  */

__IO uint16_t adc1_preempt_valuetab[3] = {0};
__IO uint16_t adc2_preempt_valuetab[3] = {0};
__IO uint32_t adc1_preempt_conversion_count = 0;
__IO uint32_t adc2_preempt_conversion_count = 0;
__IO uint32_t adc1_preempt_conversion_times_index = 0;
__IO uint32_t adc2_preempt_conversion_times_index = 0;
__IO uint32_t adc1_overflow_flag = 0;
__IO uint32_t adc2_overflow_flag = 0;
__IO uint32_t adc1_conversion_fail_flag = 0;
__IO uint32_t adc2_conversion_fail_flag = 0;
__IO uint32_t error_times_index = 0;

/**
  * @brief  gpio configuration.
  * @param  none
  * @retval none
  */
static void gpio_config(void)
{
  gpio_init_type gpio_initstructure;
  crm_periph_clock_enable(CRM_GPIOA_PERIPH_CLOCK, TRUE);

  gpio_default_para_init(&gpio_initstructure);

  /* config adc pin as analog input mode */
  gpio_initstructure.gpio_mode = GPIO_MODE_ANALOG;
  gpio_initstructure.gpio_pins = GPIO_PINS_2 |GPIO_PINS_3 |GPIO_PINS_4 | GPIO_PINS_5 | GPIO_PINS_6 | GPIO_PINS_7;
  gpio_init(GPIOA, &gpio_initstructure);
}

/**
  * @brief  adc configuration.
  * @param  none
  * @retval none
  */
static void adc_config(void)
{
  adc_common_config_type adc_common_struct;
  adc_base_config_type adc_base_struct;
  crm_periph_clock_enable(CRM_ADC1_PERIPH_CLOCK, TRUE);
  crm_periph_clock_enable(CRM_ADC2_PERIPH_CLOCK, TRUE);
  adc_reset();
  nvic_irq_enable(ADC1_2_IRQn, 0, 0);

  adc_common_default_para_init(&adc_common_struct);

  /* config combine mode */
  adc_common_struct.combine_mode = ADC_PREEMPT_INTERLTRIG_ONLY_ONESLAVE_MODE;

  /* config division,adcclk is division by hclk */
  adc_common_struct.div = ADC_HCLK_DIV_6;

  /* config common dma mode,it's not useful in independent mode */
  adc_common_struct.common_dma_mode = ADC_COMMON_DMAMODE_DISABLE;

  /* config common dma request repeat */
  adc_common_struct.common_dma_request_repeat_state = FALSE;

  /* config adjacent adc sampling interval,it's useful for ordinary shifting mode */
  adc_common_struct.sampling_interval = ADC_SAMPLING_INTERVAL_5CYCLES;

  /* config inner temperature sensor and vintrv */
  adc_common_struct.tempervintrv_state = FALSE;

  adc_common_struct.vbat_state = FALSE;
  adc_common_config(&adc_common_struct);

  adc_base_default_para_init(&adc_base_struct);

  adc_base_struct.sequence_mode = TRUE;
  adc_base_struct.repeat_mode = FALSE;
  adc_base_struct.data_align = ADC_RIGHT_ALIGNMENT;
  adc_base_struct.ordinary_channel_length = 3;
  adc_base_config(ADC1, &adc_base_struct);
  adc_resolution_set(ADC1, ADC_RESOLUTION_12B);

  /* config ordinary trigger source and trigger edge */
  adc_ordinary_conversion_trigger_set(ADC1, ADC_ORDINARY_TRIG_TMR1CH1, ADC_ORDINARY_TRIG_EDGE_NONE);

  /* config dma mode,it's not useful when common dma mode is use */
  adc_dma_mode_enable(ADC1, FALSE);

  /* config dma request repeat,it's not useful when common dma mode is use */
  adc_dma_request_repeat_enable(ADC1, FALSE);

	/* config preempt channel */
  adc_preempt_channel_length_set(ADC1, 3);
  adc_preempt_channel_set(ADC1, ADC_CHANNEL_2, 1, ADC_SAMPLETIME_47_5);
  adc_preempt_channel_set(ADC1, ADC_CHANNEL_3, 2, ADC_SAMPLETIME_47_5);
  adc_preempt_channel_set(ADC1, ADC_CHANNEL_4, 3, ADC_SAMPLETIME_47_5);

  /* config preempt trigger source and trigger edge */
  adc_preempt_conversion_trigger_set(ADC1, ADC_PREEMPT_TRIG_TMR1CH4, ADC_PREEMPT_TRIG_EDGE_NONE);

  /* disable preempt group automatic conversion after ordinary group */
  adc_preempt_auto_mode_enable(ADC1, FALSE);

  /* enable adc preempt channels conversion end interrupt */
  adc_interrupt_enable(ADC1, ADC_PCCE_INT, TRUE);

  /* enable adc overflow interrupt */
  adc_interrupt_enable(ADC1, ADC_OCCO_INT, TRUE);

  /* enable adc trigger convert fail interrupt */
  adc_interrupt_enable(ADC1, ADC_TCF_INT, TRUE);

  /* enable adc trigger conversion fail auto conversion abort */
  adc_convert_fail_auto_abort_enable(ADC1, TRUE);

  adc_base_config(ADC2, &adc_base_struct);
  adc_resolution_set(ADC2, ADC_RESOLUTION_12B);
  adc_ordinary_conversion_trigger_set(ADC2, ADC_ORDINARY_TRIG_TMR1CH1, ADC_ORDINARY_TRIG_EDGE_NONE);
  adc_dma_mode_enable(ADC2, FALSE);
  adc_dma_request_repeat_enable(ADC2, FALSE);
	adc_preempt_channel_length_set(ADC2, 3);
  adc_preempt_channel_set(ADC2, ADC_CHANNEL_5, 1, ADC_SAMPLETIME_47_5);
  adc_preempt_channel_set(ADC2, ADC_CHANNEL_6, 2, ADC_SAMPLETIME_47_5);
  adc_preempt_channel_set(ADC2, ADC_CHANNEL_7, 3, ADC_SAMPLETIME_47_5);
  adc_preempt_conversion_trigger_set(ADC2, ADC_PREEMPT_TRIG_TMR1CH4, ADC_PREEMPT_TRIG_EDGE_NONE);
  adc_preempt_auto_mode_enable(ADC2, FALSE);
  adc_interrupt_enable(ADC2, ADC_PCCE_INT, TRUE);
  adc_interrupt_enable(ADC2, ADC_OCCO_INT, TRUE);
  adc_interrupt_enable(ADC2, ADC_TCF_INT, TRUE);
  adc_convert_fail_auto_abort_enable(ADC2, TRUE);

  /* adc enable */
  adc_enable(ADC1, TRUE);
  adc_enable(ADC2, TRUE);
  while(adc_flag_get(ADC1, ADC_RDY_FLAG) == RESET)
  {
  }
  while(adc_flag_get(ADC2, ADC_RDY_FLAG) == RESET)
  {
  }

  /* adc calibration */
  adc_calibration_init(ADC1);
  while(adc_calibration_init_status_get(ADC1));
  adc_calibration_start(ADC1);
  while(adc_calibration_status_get(ADC1));
  adc_calibration_init(ADC2);
  while(adc_calibration_init_status_get(ADC2));
  adc_calibration_start(ADC2);
  while(adc_calibration_status_get(ADC2));
}

/**
  * @brief  adc configuration.
  * @param  none
  * @retval none
  */
void adc_convert_recovery_process(void)
{
  uint32_t recovery_index = 0;

  /* disable adc */
  adc_enable(ADC1, FALSE);
  adc_enable(ADC2, FALSE);

  /* record adc mode configuration */
  recovery_index = adc_combine_mode_get();

  /* clear adc mode configuration */
  adc_combine_mode_set(ADC_INDEPENDENT_MODE);

  /* recovery adc mode configuration */
  adc_combine_mode_set((adc_combine_mode_type)recovery_index);

  /* enable adc to detection trigger */
  adc_enable(ADC1, TRUE);
  adc_enable(ADC2, TRUE);
}

/**
  * @brief  this function handles adc handler.
  * @param  none
  * @retval none
  */
void ADC1_2_IRQHandler(void)
{
  if(adc_interrupt_flag_get(ADC1, ADC_TCF_FLAG) != RESET)
  {
    adc_flag_clear(ADC1, ADC_TCF_FLAG);
    adc1_conversion_fail_flag++;

    /* to avoid data wrong,it is recommended to add the following recovery code */
    adc_convert_recovery_process();
  }

  if(adc_interrupt_flag_get(ADC1, ADC_OCCO_FLAG) != RESET)
  {
    adc_flag_clear(ADC1, ADC_OCCO_FLAG);
    adc1_overflow_flag++;

    /* to avoid data wrong,it is recommended to add the following recovery code */
    adc_convert_recovery_process();
  }

  if(adc_interrupt_flag_get(ADC2, ADC_TCF_FLAG) != RESET)
  {
    adc_flag_clear(ADC2, ADC_TCF_FLAG);
    adc2_conversion_fail_flag++;

    /* to avoid data wrong,it is recommended to add the following recovery code */
    adc_convert_recovery_process();
  }

  if(adc_interrupt_flag_get(ADC2, ADC_OCCO_FLAG) != RESET)
  {
    adc_flag_clear(ADC2, ADC_OCCO_FLAG);
    adc2_overflow_flag++;

    /* to avoid data wrong,it is recommended to add the following recovery code */
    adc_convert_recovery_process();
  }

	if(adc_interrupt_flag_get(ADC1, ADC_PCCE_FLAG) != RESET)
  {
    adc_flag_clear(ADC1, ADC_PCCE_FLAG);
    adc1_preempt_valuetab[0] = adc_preempt_conversion_data_get(ADC1, ADC_PREEMPT_CHANNEL_1);
    adc1_preempt_valuetab[1] = adc_preempt_conversion_data_get(ADC1, ADC_PREEMPT_CHANNEL_2);
    adc1_preempt_valuetab[2] = adc_preempt_conversion_data_get(ADC1, ADC_PREEMPT_CHANNEL_3);
    adc1_preempt_conversion_count++;
  }

  if(adc_interrupt_flag_get(ADC2, ADC_PCCE_FLAG) != RESET)
  {
    adc_flag_clear(ADC2, ADC_PCCE_FLAG);
    adc2_preempt_valuetab[0] = adc_preempt_conversion_data_get(ADC2, ADC_PREEMPT_CHANNEL_1);
    adc2_preempt_valuetab[1] = adc_preempt_conversion_data_get(ADC2, ADC_PREEMPT_CHANNEL_2);
    adc2_preempt_valuetab[2] = adc_preempt_conversion_data_get(ADC2, ADC_PREEMPT_CHANNEL_3);
    adc2_preempt_conversion_count++;
  }
}

/**
  * @brief  main function.
  * @param  none
  * @retval none
  */
int main(void)
{
  nvic_priority_group_config(NVIC_PRIORITY_GROUP_4);

  /* config the system clock */
  system_clock_config();

  /* init at start board */
  at32_board_init();
  at32_led_off(LED2);
  at32_led_off(LED3);
  at32_led_off(LED4);
  uart_print_init(115200);
  gpio_config();
  adc_config();
  printf("combine_mode_preempt_interltrig \r\n");
  while(1)
  {
    adc_preempt_software_trigger_enable(ADC1, TRUE);
    delay_sec(1);
    at32_led_toggle(LED2);
    if(adc1_preempt_conversion_times_index != adc1_preempt_conversion_count)
    {
      /* printf data when conversion end without error */
      adc1_preempt_conversion_times_index = adc1_preempt_conversion_count;
      printf("adc1_preempt_conversion_times_index = %d\r\n",adc1_preempt_conversion_times_index);
      printf("adc1_preempt_valuetab[0] = 0x%x\r\n", adc1_preempt_valuetab[0]);
      printf("adc1_preempt_valuetab[1] = 0x%x\r\n", adc1_preempt_valuetab[1]);
      printf("adc1_preempt_valuetab[2] = 0x%x\r\n", adc1_preempt_valuetab[2]);
      printf("\r\n");
    }
    if(adc2_preempt_conversion_times_index != adc2_preempt_conversion_count)
    {
      /* printf data when conversion end without error */
      adc2_preempt_conversion_times_index = adc2_preempt_conversion_count;
      printf("adc2_preempt_conversion_times_index = %d\r\n",adc2_preempt_conversion_times_index);
      printf("adc2_preempt_valuetab[0] = 0x%x\r\n", adc2_preempt_valuetab[0]);
      printf("adc2_preempt_valuetab[1] = 0x%x\r\n", adc2_preempt_valuetab[1]);
      printf("adc2_preempt_valuetab[2] = 0x%x\r\n", adc2_preempt_valuetab[2]);
      printf("\r\n");
    }
    if(error_times_index != (adc1_overflow_flag + adc2_overflow_flag + adc1_conversion_fail_flag + adc2_conversion_fail_flag))
    {
      /* printf flag when error occur */
      error_times_index = adc1_overflow_flag + adc2_overflow_flag + adc1_conversion_fail_flag + adc2_conversion_fail_flag;
      at32_led_on(LED3);
      at32_led_on(LED4);
      printf("error occur\r\n");
      printf("error_times_index = %d\r\n",error_times_index);
      printf("adc1_overflow_flag = %d\r\n",adc1_overflow_flag);
      printf("adc2_overflow_flag = %d\r\n",adc2_overflow_flag);
      printf("adc1_conversion_fail_flag = %d\r\n",adc1_conversion_fail_flag);
      printf("adc2_conversion_fail_flag = %d\r\n",adc2_conversion_fail_flag);
      printf("\r\n");
    }
  }
}

/**
  * @}
  */

/**
  * @}
  */

